package Plugin

import "fmt"


//
//  LoadLogo
//  @Description: 打印首屏字符，系统入口点
//
func LoadLogo() {
	fmt.Print(`
 /$$   /$$                                         /$$                    
| $$  | $$                                        | $$                    
| $$  | $$  /$$$$$$   /$$$$$$   /$$$$$$$ /$$   /$$| $$  /$$$$$$   /$$$$$$$
| $$$$$$$$ /$$__  $$ /$$__  $$ /$$_____/| $$  | $$| $$ /$$__  $$ /$$_____/
| $$__  $$| $$$$$$$$| $$  \__/| $$      | $$  | $$| $$| $$$$$$$$|  $$$$$$ 
| $$  | $$| $$_____/| $$      | $$      | $$  | $$| $$| $$_____/ \____  $$
| $$  | $$|  $$$$$$$| $$      |  $$$$$$$|  $$$$$$/| $$|  $$$$$$$ /$$$$$$$/
|__/  |__/ \_______/|__/       \_______/ \______/ |__/ \_______/|_______/
`)
	fmt.Println("Sign:\tPowered by B0mb2017")
	fmt.Println("LastVersion:\t2021年4月7日")
	fmt.Println("请注意，使用工具前需要确认Excel中Sheet1的A列是待发送的邮箱，系统将A列所有合法地址添加到内存中进行发送")
	fmt.Println("请注意，使用工具前需要确认tpl.txt中保存的为Html5格式的邮件正文，系统将正文加载到内存中去")
	fmt.Println("请注意，使用工具前需要确认tpl.txt中保存的为Html5格式的邮件正文，且正文中存在需要被replace的链接`http://1.com`")
}
